anachrocomputer/STM32_I2C_OLED/i2c_oled.c
void drawSegH(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD, x + WD + 3, GY);
      setHline(x + WD, x + WD + 3, GY + 1);
      break;
   case LED_STYLE:
      drawLed(x, 4, 3);
      break;
   case VFD_STYLE:
      setHline(x + WD,     x + WD + 3, 15);
      setHline(x + WD - 1, x + WD + 3, 16);
      setHline(x + WD,     x + WD + 3, 17);
      break;
   }
}


void drawSegI(const int x, const int style)
{
   switch (style) {
   case LED_STYLE:
      drawLed(x, 0, 0);
      break;
   }
}


void drawSegJ(const int x, const int style)
{
   switch (style) {
   case LED_STYLE:
      drawLed(x, 3, 0);
      break;
   }
}


void drawSegK(const int x, const int style)
{
   switch (style) {
   case LED_STYLE:
      drawLed(x, 3, 3);
      break;
   }
}


void drawSegL(const int x, const int style)
{
   switch (style) {
   case LED_STYLE:
      drawLed(x, 3, 6);
      break;
   }
}


void drawSegM(const int x, const int style)
{
   switch (style) {
   case LED_STYLE:
      drawLed(x, 0, 6);
      break;
   }
}


void drawSegN(const int x, const int style)
{
   switch (style) {
   case LED_STYLE:
      drawLed(x, 0, 3);
      break;
   }
}


void drawSegDP(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD + 2, x + WD + 4, 29);
      setHline(x + WD + 2, x + WD + 4, 30);
      setHline(x + WD + 2, x + WD + 4, 31);
   case LED_STYLE:
      drawLed(x, 4, 6);
      break;
   case VFD_STYLE:
      setHline(x + WD + 2, x + WD + 4, 29);
      setHline(x + WD + 2, x + WD + 4, 30);
      setHline(x + WD + 2, x + WD + 4, 31);
      break;
   }
   
}


void renderHexDigit(const int x, const int digit, const int style)
{
   switch (digit) {
   case 0:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegK(x, style);
      drawSegN(x, style);
      break;
   case 1:
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 2:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      break;
   case 3:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegM(x, style);
      break;
   case 4:
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegH(x, style);  // Special segment just for 4
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 5:
      drawSegA(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegM(x, style);
      break;
   case 6:
      drawSegA(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegJ(x, style);
      drawSegN(x, style);
      break;
   case 7:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegF(x, style);  // Hooked 7
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 8:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      break;
   case 9:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegK(x, style);
      drawSegM(x, style);
      break;
   case 0xA:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   case 0xB:
      drawSegC(x, style);     // Lowercase 'b'
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      if (style == LED_STYLE) {
         drawSegA(x, style);  // Uppercase 'B'
         drawSegB(x, style);
         drawSegI(x, style);
         drawSegM(x, style);
         drawSegN(x, style);
      }
      break;
   case 0xC:
      drawSegA(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegJ(x, style);
      drawSegL(x, style);
      drawSegN(x, style);
      break;
   case 0xD:
      if (style == LED_STYLE) {
         drawSegA(x, style);  // Uppercase 'D'
         drawSegB(x, style);
         drawSegC(x, style);
         drawSegD(x, style);
         drawSegE(x, style);
         drawSegF(x, style);
         drawSegI(x, style);
         drawSegK(x, style);
         drawSegM(x, style);
         drawSegN(x, style);
      }
      else {
         drawSegB(x, style);  // Lowercase 'd'
         drawSegC(x, style);
         drawSegD(x, style);
         drawSegE(x, style);
         drawSegG(x, style);
      }
      break;
   case 0xE:
      drawSegA(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   case 0xF:
      drawSegA(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   }
}


/* _write --- connect stdio functions to UART1 */

int _write(const int fd, const char *ptr, const int len)
{
   int i;

   for (i = 0; i < len; i++) {
      if (*ptr == '\n')
         UART1TxByte('\r');
      
      UART1TxByte(*ptr++);
   }
  
   return (len);
}


