anachrocomputer/STM32_I2C_OLED/i2c_oled.c
            flag = !flag;
            
            printf("millis() = %ld\n", millis());
         }
         
         Tick = 0;
      }
      
      if (UART1RxAvailable()) {
         const uint8_t ch = UART1RxByte();
         
         printf("UART1: %02x\n", ch);
         switch (ch) {
         case 'r':
         case 'R':
            setRect(0, 0, MAXX - 1, MAXY - 1);
            updscreen();
            break;
         case 'q':
         case 'Q':
            setVline(MAXX / 4,       0, MAXY - 1);
            setVline(MAXX / 2,       0, MAXY - 1);
            setVline((MAXX * 3) / 4, 0, MAXY - 1);
            updscreen();
            break;
         case 'g':
            digit = 0;
            x = digit * width;
            break;
         case 'h':
            digit = 1;
            x = digit * width;
            break;
         case 'i':
            digit = 2;
            x = digit * width;
            break;
         case 'j':
            digit = 3;
            x = digit * width;
            break;
         case 'k':
            digit = 4;
            x = digit * width;
            break;
         case 'l':
            digit = 5;
            x = digit * width;
            break;
         case '0':
            renderHexDigit(x, 0, style);
            updscreen();
            break;
         case '1':
            renderHexDigit(x, 1, style);
            updscreen();
            break;
         case '2':
            renderHexDigit(x, 2, style);
            updscreen();
            break;
         case '3':
            renderHexDigit(x, 3, style);
            updscreen();
            break;
         case '4':
            renderHexDigit(x, 4, style);
            updscreen();
            break;
         case '5':
            renderHexDigit(x, 5, style);
            updscreen();
            break;
         case '6':
            renderHexDigit(x, 6, style);
            updscreen();
            break;
         case '7':
            renderHexDigit(x, 7, style);
            updscreen();
            break;
         case '8':
            renderHexDigit(x, 8, style);
            updscreen();
            break;
         case '9':
            renderHexDigit(x, 9, style);
            updscreen();
            break;
         case 'a':
         case 'A':
            renderHexDigit(x, 0xA, style);
            updscreen();
            break;
         case 'b':
         case 'B':
            renderHexDigit(x, 0xB, style);
            updscreen();
            break;
         case 'c':
         case 'C':
            renderHexDigit(x, 0xC, style);
            updscreen();
            break;
         case 'd':
         case 'D':
            renderHexDigit(x, 0xD, style);
            updscreen();
            break;
         case 'e':
         case 'E':
            renderHexDigit(x, 0xE, style);
            updscreen();
            break;
         case 'f':
         case 'F':
            renderHexDigit(x, 0xF, style);
            updscreen();
            break;
         case 'o':
         case 'O':
            memcpy(Frame, OLEDImage, sizeof (Frame));
            updscreen();
            break;
         case 'p':
         case 'P':
            drawSegDP(x, style);
            updscreen();
            break;
         case 'v':
         case 'V':
            style = VFD_STYLE;
            break;
         case 'w':
         case 'W':
            style = LED_STYLE;
            break;
         case 'x':
         case 'X':
            style = PANAPLEX_STYLE;
            break;
         case 'z':
         case 'Z':
            memset(Frame, 0, sizeof (Frame));
            updscreen();
            break;
         }
      }
   }
}

